```hcl
resource "google_app_engine_standard_app_version" "gae" {
  version_id       = local.git_hash_short
  service          = "tf-issue-13766"
  runtime          = "python38"
  threadsafe       = true
  instance_class   = "F1"

  entrypoint {
    shell = "true"
  }

  deployment {
    zip {
      source_url = "https://storage.googleapis.com/${data.terraform_remote_state.project.outputs.assets_bucket.name}/${google_storage_bucket_object.assets.output_name}"
    }
  }

  handlers {
    auth_fail_action = "AUTH_FAIL_ACTION_REDIRECT"
    login            = "LOGIN_OPTIONAL"
    security_level   = "SECURE_ALWAYS"
    url_regex        = "/something/(.*\\.(ico|png|jpg|jpeg|gif|svg|txt|xml|js|map|css|eot|woff|woff2))$"

    static_files {
      application_readable  = false
      expiration            = "604800s"
      http_headers          = {}
      path                  = "\\1"
      require_matching_file = false
      upload_path_regex     = ".*\\.(ico|png|jpg|jpeg|gif|svg|txt|xml|js|map|css|eot|woff|woff2)$"
    }
  }

  handlers {
    auth_fail_action = "AUTH_FAIL_ACTION_REDIRECT"
    login            = "LOGIN_OPTIONAL"
    security_level   = "SECURE_ALWAYS"
    url_regex        = "/something.*"

    static_files {
      application_readable  = false
      expiration            = "0s"
      http_headers          = {}
      path                  = "index.html"
      require_matching_file = false
      upload_path_regex     = "index.html"
    }
  }

  // We will clean up old versions outside of tf
  noop_on_destroy = true

  // If we deleted all versions, we also delete the service
  delete_service_on_destroy = true

  lifecycle {
    create_before_destroy = true
  }
}

resource "google_app_engine_service_split_traffic" "gae" {
  service         = google_app_engine_standard_app_version.gae.service
  migrate_traffic = true

  split {
    shard_by    = "IP"
    allocations = { (google_app_engine_standard_app_version.gae.version_id) = 1 }
  }
}
```

The Plan:
```
  # google_app_engine_service_split_traffic.gae will be created
  + resource "google_app_engine_service_split_traffic" "gae" {
      + id              = (known after apply)
      + migrate_traffic = true
      + project         = (known after apply)
      + service         = "tf-issue-13766"

      + split {
          + allocations = {
              + "4d86979" = "1"
            }
          + shard_by    = "IP"
        }
    }

  # google_app_engine_standard_app_version.gae will be created
  + resource "google_app_engine_standard_app_version" "gae" {
      + delete_service_on_destroy = true
      + id                        = (known after apply)
      + instance_class            = "F1"
      + name                      = (known after apply)
      + noop_on_destroy           = true
      + project                   = (known after apply)
      + runtime                   = "python38"
      + service                   = "tf-issue-13766"
      + service_account           = (known after apply)
      + threadsafe                = true
      + version_id                = "4d86979"

      + deployment {

          + zip {
              + source_url = (known after apply)
            }
        }

      + entrypoint {
          + shell = "true"
        }

      + handlers {
          + auth_fail_action = "AUTH_FAIL_ACTION_REDIRECT"
          + login            = "LOGIN_OPTIONAL"
          + security_level   = "SECURE_ALWAYS"
          + url_regex        = "/something/(.*\\.(ico|png|jpg|jpeg|gif|svg|txt|xml|js|map|css|eot|woff|woff2))$"

          + static_files {
              + application_readable  = false
              + expiration            = "604800s"
              + path                  = "\\1"
              + require_matching_file = false
              + upload_path_regex     = ".*\\.(ico|png|jpg|jpeg|gif|svg|txt|xml|js|map|css|eot|woff|woff2)$"
            }
        }
      + handlers {
          + auth_fail_action = "AUTH_FAIL_ACTION_REDIRECT"
          + login            = "LOGIN_OPTIONAL"
          + security_level   = "SECURE_ALWAYS"
          + url_regex        = "/something.*"

          + static_files {
              + application_readable  = false
              + expiration            = "0s"
              + path                  = "index.html"
              + require_matching_file = false
              + upload_path_regex     = "index.html"
            }
        }
    }
```

The Apply Log (snipped to POST for creation and GET for validation):
```
...
google_app_engine_standard_app_version.gae: Creating...
2023-03-08T08:54:39.479+0100 [INFO]  Starting apply for google_app_engine_standard_app_version.gae
2023-03-08T08:54:39.480+0100 [DEBUG] google_app_engine_standard_app_version.gae: applying the planned Create change
2023-03-08T08:54:39.482+0100 [INFO]  provider.terraform-provider-google_v4.53.1_x5: 2023/03/08 08:54:39 [DEBUG] Locking "apps/redacted_project": timestamp=2023-03-08T08:54:39.482+0100
2023-03-08T08:54:39.482+0100 [INFO]  provider.terraform-provider-google_v4.53.1_x5: 2023/03/08 08:54:39 [DEBUG] Locked "apps/redacted_project": timestamp=2023-03-08T08:54:39.482+0100
2023-03-08T08:54:39.482+0100 [INFO]  provider.terraform-provider-google_v4.53.1_x5: 2023/03/08 08:54:39 [DEBUG] Creating new StandardAppVersion: map[string]interface {}{"deployment":map[string]interface {}{"zip":
map[string]interface {}{"sourceUrl":"https://storage.googleapis.com/redacted_bucket/gae/tf-issue-13766/4d86979.zip"}}, "entrypoint":map[string]interface {}{"shell":"true"}
, "handlers":[]interface {}{map[string]interface {}{"authFailAction":"AUTH_FAIL_ACTION_REDIRECT", "login":"LOGIN_OPTIONAL", "securityLevel":"SECURE_ALWAYS", "staticFiles":map[string]interface {}{"expiration":"604
800s", "path":"\\1", "uploadPathRegex":".*\\.(ico|png|jpg|jpeg|gif|svg|txt|xml|js|map|css|eot|woff|woff2)$"}, "urlRegex":"/something/(.*\\.(ico|png|jpg|jpeg|gif|svg|txt|xml|js|map|css|eot|woff|woff2))$"}, map[str
ing]interface {}{"authFailAction":"AUTH_FAIL_ACTION_REDIRECT", "login":"LOGIN_OPTIONAL", "securityLevel":"SECURE_ALWAYS", "staticFiles":map[string]interface {}{"expiration":"0s", "path":"index.html", "uploadPathR
egex":"index.html"}, "urlRegex":"/something.*"}}, "id":"4d86979", "instanceClass":"F1", "runtime":"python38", "threadsafe":true}: timestamp=2023-03-08T08:54:39.482+0100
2023-03-08T08:54:39.482+0100 [INFO]  provider.terraform-provider-google_v4.53.1_x5: 2023/03/08 08:54:39 [DEBUG] Waiting for state to become: [success]: timestamp=2023-03-08T08:54:39.482+0100
2023-03-08T08:54:39.482+0100 [INFO]  provider.terraform-provider-google_v4.53.1_x5: 2023/03/08 08:54:39 [DEBUG] Retry Transport: starting RoundTrip retry loop: timestamp=2023-03-08T08:54:39.482+0100
2023-03-08T08:54:39.482+0100 [INFO]  provider.terraform-provider-google_v4.53.1_x5: 2023/03/08 08:54:39 [DEBUG] Retry Transport: request attempt 0: timestamp=2023-03-08T08:54:39.482+0100
2023-03-08T08:54:39.482+0100 [INFO]  provider.terraform-provider-google_v4.53.1_x5: 2023/03/08 08:54:39 [DEBUG] Google API Request Details:
---[ REQUEST ]---------------------------------------
POST /v1/apps/redacted_project/services/tf-issue-13766/versions?alt=json HTTP/1.1
Host: appengine.googleapis.com
User-Agent: Terraform/1.3.5 (+https://www.terraform.io) Terraform-Plugin-SDK/2.10.1 terraform-provider-google/4.53.1
Content-Length: 827
Content-Type: application/json
X-Goog-User-Project: redacted_project
Accept-Encoding: gzip

{
 "deployment": {
  "zip": {
   "sourceUrl": "https://storage.googleapis.com/redacted_bucket/gae/tf-issue-13766/4d86979.zip"
  }
 },
 "entrypoint": {
  "shell": "true"
 },
 "handlers": [
  {
   "authFailAction": "AUTH_FAIL_ACTION_REDIRECT",
   "login": "LOGIN_OPTIONAL",
   "securityLevel": "SECURE_ALWAYS",
   "staticFiles": {
    "expiration": "604800s",
    "path": "\\1",
    "uploadPathRegex": ".*\\.(ico|png|jpg|jpeg|gif|svg|txt|xml|js|map|css|eot|woff|woff2)$"
   },
   "urlRegex": "/something/(.*\\.(ico|png|jpg|jpeg|gif|svg|txt|xml|js|map|css|eot|woff|woff2))$"
  },
  {
   "authFailAction": "AUTH_FAIL_ACTION_REDIRECT",
   "login": "LOGIN_OPTIONAL",
   "securityLevel": "SECURE_ALWAYS",
   "staticFiles": {
    "expiration": "0s",
    "path": "index.html",
    "uploadPathRegex": "index.html"
   },
   "urlRegex": "/something.*"
  }
 ],
 "id": "4d86979",
 "instanceClass": "F1",
 "runtime": "python38",
 "threadsafe": true
}

-----------------------------------------------------: timestamp=2023-03-08T08:54:39.482+0100
2023-03-08T08:54:39.904+0100 [INFO]  provider.terraform-provider-google_v4.53.1_x5: 2023/03/08 08:54:39 [DEBUG] Google API Response Details:
---[ RESPONSE ]--------------------------------------
HTTP/2.0 200 OK
Alt-Svc: h3=":443"; ma=2592000,h3-29=":443"; ma=2592000
Cache-Control: private
Content-Type: application/json; charset=UTF-8
Date: Wed, 08 Mar 2023 07:54:39 GMT
Server: ESF
Vary: Origin
Vary: X-Origin
Vary: Referer
X-Content-Type-Options: nosniff
X-Frame-Options: SAMEORIGIN
X-Xss-Protection: 0

{
  "name": "apps/redacted_project/operations/bcbb3670-f6cf-442c-8f60-55008cc0bfd5",
  "metadata": {
    "@type": "type.googleapis.com/google.appengine.v1.OperationMetadataV1",
    "method": "google.appengine.v1.Versions.CreateVersion",
    "insertTime": "2023-03-08T07:54:39.843Z",
    "user": "redacted_account",
    "target": "apps/redacted_project/services/tf-issue-13766/versions/4d86979"
  }
}

-----------------------------------------------------: timestamp=2023-03-08T08:54:39.904+0100
...
2023-03-08T08:55:41.756+0100 [INFO]  provider.terraform-provider-google_v4.53.1_x5: 2023/03/08 08:55:41 [DEBUG] Google API Request Details:
---[ REQUEST ]---------------------------------------
GET /v1/apps/redacted_project/services/tf-issue-13766/versions/4d86979?alt=json&view=FULL HTTP/1.1
Host: appengine.googleapis.com
User-Agent: Terraform/1.3.5 (+https://www.terraform.io) Terraform-Plugin-SDK/2.10.1 terraform-provider-google/4.53.1
Content-Type: application/json
X-Goog-User-Project: redacted_project
Accept-Encoding: gzip


-----------------------------------------------------: timestamp=2023-03-08T08:55:41.756+0100
2023-03-08T08:55:41.866+0100 [INFO]  provider.terraform-provider-google_v4.53.1_x5: 2023/03/08 08:55:41 [DEBUG] Google API Response Details:
---[ RESPONSE ]--------------------------------------
HTTP/2.0 200 OK
Alt-Svc: h3=":443"; ma=2592000,h3-29=":443"; ma=2592000
Cache-Control: private
Content-Type: application/json; charset=UTF-8
Date: Wed, 08 Mar 2023 07:55:41 GMT
Server: ESF
Vary: Origin
Vary: X-Origin
Vary: Referer
X-Content-Type-Options: nosniff
X-Frame-Options: SAMEORIGIN
X-Xss-Protection: 0

{
  "name": "apps/redacted_project/services/tf-issue-13766/versions/4d86979",
  "id": "4d86979",
  "instanceClass": "F1",
  "network": {},
  "runtime": "python38",
  "threadsafe": true,
  "env": "standard",
  "servingStatus": "SERVING",
  "createdBy": "redacted_account",
  "createTime": "2023-03-08T07:55:29Z",
  "diskUsageBytes": "4440348",
  "handlers": [
    {
      "urlRegex": "/something/(.*\\.(ico|png|jpg|jpeg|gif|svg|txt|xml|js|map|css|eot|woff|woff2))$",
      "staticFiles": {
        "path": "\\1",
        "uploadPathRegex": ".*\\.(ico|png|jpg|jpeg|gif|svg|txt|xml|js|map|css|eot|woff|woff2)$",
        "expiration": "604800s"
      },
      "securityLevel": "SECURE_ALWAYS",
      "login": "LOGIN_OPTIONAL",
      "authFailAction": "AUTH_FAIL_ACTION_REDIRECT"
    },
    {
      "urlRegex": "/something.*",
      "staticFiles": {
        "path": "index.html",
        "uploadPathRegex": "index.html",
        "expiration": "0s"
      },
      "securityLevel": "SECURE_ALWAYS",
      "login": "LOGIN_OPTIONAL",
      "authFailAction": "AUTH_FAIL_ACTION_REDIRECT"
    },
    {
      "urlRegex": ".*",
      "script": {
        "scriptPath": "auto"
      },
      "securityLevel": "SECURE_OPTIONAL",
      "login": "LOGIN_OPTIONAL",
      "authFailAction": "AUTH_FAIL_ACTION_REDIRECT"
    }
  ],
  "deployment": {
...
  },
  "versionUrl": "https://4d86979-dot-tf-issue-13766-dot-redacted_project.appspot.com",
  "runtimeChannel": "default",
  "serviceAccount": "redacted_project@appspot.gserviceaccount.com"
}

-----------------------------------------------------: timestamp=2023-03-08T08:55:41.865+0100
2023-03-08T08:55:41.866+0100 [INFO]  provider.terraform-provider-google_v4.53.1_x5: 2023/03/08 08:55:41 [DEBUG] Retry Transport: Stopping retries, last request was successful: timestamp=2023-03-08T08:55:41.866+0100
2023-03-08T08:55:41.866+0100 [INFO]  provider.terraform-provider-google_v4.53.1_x5: 2023/03/08 08:55:41 [DEBUG] Retry Transport: Returning after 1 attempts: timestamp=2023-03-08T08:55:41.866+0100
2023-03-08T08:55:41.867+0100 [INFO]  provider.terraform-provider-google_v4.53.1_x5: 2023/03/08 08:55:41 [DEBUG] Unlocking "apps/redacted_project": timestamp=2023-03-08T08:55:41.867+0100
2023-03-08T08:55:41.867+0100 [INFO]  provider.terraform-provider-google_v4.53.1_x5: 2023/03/08 08:55:41 [DEBUG] Unlocked "apps/redacted_project": timestamp=2023-03-08T08:55:41.867+0100
2023-03-08T08:55:41.869+0100 [WARN]  Provider "provider[\"registry.terraform.io/hashicorp/google\"]" produced an unexpected new value for google_app_engine_standard_app_version.gae, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .runtime_api_version: was null, but now cty.StringVal("")
      - .app_engine_apis: was null, but now cty.False
      - .deployment[0].zip[0].files_count: was null, but now cty.NumberIntVal(0)
      - .handlers: block count changed from 2 to 3
[0m[1mgoogle_app_engine_standard_app_version.gae: Creation complete after 1m3s [id=apps/redacted_project/services/tf-issue-13766/versions/4d86979][0m
```

As you can see here the handlers that were POST'ed to create the resource match the terraform but once the creation completes it actually responds with one additional handler:
```
    {
      "urlRegex": ".*",
      "script": {
        "scriptPath": "auto"
      },
      "securityLevel": "SECURE_OPTIONAL",
      "login": "LOGIN_OPTIONAL",
      "authFailAction": "AUTH_FAIL_ACTION_REDIRECT"
    }
```

This is yet again a whole new app-engine service, I have not re-used any names or assets. This is a blank state.